export const COLORS: Record<string, string> = {
  light_blue: '#5d5fef',
  pink: '#ef5da8',
};

export const slides: { date: string; description: string }[] = [
  {
    date: '1995',
    description:
      'Обнаружена первая экзопланета 51 Пегаса b – начало новой эры астрономии.',
  },
  {
    date: '1999',
    description:
      'Запущен телескоп Чандра – один из самых мощных рентгеновских телескопов.',
  },
  {
    date: '2001',
    description: 'Завершена первая полная расшифровка генома человека.',
  },
  {
    date: '2004',
    description:
      'Илон Маск основал SpaceX, компанию, которая изменила космическую индустрию.',
  },
  {
    date: '2009',
    description: 'Запущен космический телескоп Кеплер для поиска экзопланет.',
  },
  {
    date: '2012',
    description:
      'В CERN объявили об открытии бозона Хиггса – ключевого компонента Стандартной модели.',
  },
];
