interface IPeriod {
  period: string;
  events: {
    date: number;
    description: string;
  }[];
}

export const progressPeriods: IPeriod[] = [
  {
    period: '1975 - 1985',
    events: [
      {
        date: 1975,
        description: 'Выпуск первого персонального компьютера Altair 8800.',
      },
      {
        date: 1976,
        description:
          'Создание компании Apple и выпуск первого компьютера Apple I.',
      },
      {
        date: 1981,
        description: 'IBM выпускает свой первый персональный компьютер.',
      },
      {
        date: 1983,
        description:
          'Появление первых массовых операционных систем, таких как MS-DOS.',
      },
      {
        date: 1984,
        description: 'Выпуск первого Macintosh с графическим интерфейсом.',
      },
    ],
  },
  {
    period: '1985 - 1997',
    events: [
      { date: 1985, description: 'Появление Windows 1.0.' },
      {
        date: 1989,
        description: 'Создание World Wide Web (WWW) Тимом Бернерсом-Ли.',
      },
      { date: 1991, description: 'Первый браузер для интернета Mosaic.' },
      {
        date: 1993,
        description:
          'Появление первой коммерческой версии браузера Netscape Navigator.',
      },
      {
        date: 1995,
        description:
          'Запуск Windows 95, революция в пользовательском интерфейсе.',
      },
      { date: 1997, description: 'Запуск поисковой системы Google.' },
    ],
  },
  {
    period: '1997 - 2009',
    events: [
      { date: 1997, description: 'Запуск первого iMac от Apple.' },
      {
        date: 2000,
        description: 'Появление первых смартфонов с функциональностью PDA.',
      },
      {
        date: 2001,
        description:
          'Запуск Windows XP, революция в пользовательском интерфейсе и стабильности системы.',
      },
      { date: 2004, description: 'Запуск социальной сети Facebook.' },
      {
        date: 2007,
        description:
          'Выпуск первого iPhone, который перевернул мобильную индустрию.',
      },
      {
        date: 2009,
        description:
          'Начало развития облачных технологий и сервисов, таких как Dropbox.',
      },
    ],
  },
  {
    period: '2009 - 2021',
    events: [
      {
        date: 2009,
        description:
          'Появление первых Android-смартфонов, которые конкурируют с iPhone.',
      },
      { date: 2010, description: 'Выпуск первого iPad, начало эры планшетов.' },
      {
        date: 2012,
        description:
          'Запуск Google Glass и начало исследований в области дополненной реальности.',
      },
      {
        date: 2014,
        description:
          'Появление технологий носимых устройств, таких как Apple Watch.',
      },
      {
        date: 2016,
        description: 'Запуск Amazon Echo и развитие умных колонок.',
      },
      {
        date: 2020,
        description:
          'Широкое распространение 5G технологий и их применение в мобильных устройствах.',
      },
    ],
  },
  {
    period: '2021 - 2030',
    events: [
      {
        date: 2021,
        description:
          'Расширение применения искусственного интеллекта в повседневной жизни.',
      },
      {
        date: 2022,
        description:
          'Развитие квантовых вычислений, начало использования квантовых компьютеров для специализированных задач.',
      },
      {
        date: 2023,
        description:
          'Распространение технологий дополненной реальности (AR) и виртуальной реальности (VR).',
      },
      {
        date: 2024,
        description:
          'Внедрение технологий 6G и расширение возможностей Интернета вещей.',
      },
      {
        date: 2025,
        description:
          'Появление автономных транспортных средств на дорогах и в воздушном пространстве.',
      },
    ],
  },
  {
    period: '2030 - 2040',
    events: [
      {
        date: 2030,
        description:
          'Широкое распространение нейросетевых технологий и их внедрение в различные отрасли.',
      },
      {
        date: 2032,
        description:
          'Использование биотехнологий для улучшения человеческого здоровья и продолжительности жизни.',
      },
      {
        date: 2035,
        description:
          'Создание полностью автономных умных городов с использованием 6G и квантовых вычислений.',
      },
      {
        date: 2038,
        description:
          'Появление первого поколения полностью автономных роботов, работающих без контроля человека.',
      },
      {
        date: 2040,
        description:
          'Активное внедрение экологически чистых технологий и устойчивой энергетики в глобальную инфраструктуру.',
      },
    ],
  },
];
